### pandas----> data analysis and data cleaning.

Two primary data structure-
1. Series
2.DataFram

In [ ]:
import pandas as pd
data={
    'name':['sans','ajay','sssd'],
    'age':[25,30,32],
    'city':['bdjje','dshjb','djhbj']'
}
df=pd.DataFrame(data)
print(df)
type(df)

   name  age    city
0  sans   25   bdjje
1  ajay   30   dshjb
2  sssd   32  djhbj]

pandas.core.frame.DataFrame

In [6]:
import numpy as np
np.array(df)

array([['sans', 25, 'bdjje'],
       ['ajay', 30, 'dshjb'],
       ['sssd', 32, 'djhbj]']], dtype=object)

In [10]:
##creating from list of dict


data=[
    {'name':'sans','age':32,'city':'bang'},
    {'name':'sans','age':32,'city':'bang'},
    {'name':'sans','age':32,'city':'bang'}
]
df=pd.DataFrame(data)
print(df)

   name  age  city
0  sans   32  bang
1  sans   32  bang
2  sans   32  bang

In [15]:
df=pd.read_csv('sales_data.csv')
print(df.head(5))
df.tail(5)

   Transaction ID      Date Product Category             Product Name  \
0           10001  1/1/2024      Electronics            iPhone 14 Pro
1           10002  1/2/2024  Home Appliances         Dyson V11 Vacuum
2           10003  1/3/2024         Clothing         Levi's 501 Jeans
3           10004  1/4/2024            Books        The Da Vinci Code
4           10005  1/5/2024  Beauty Products  Neutrogena Skincare Set

   Units Sold  Unit Price  Total Revenue         Region Payment Method
0           2      999.99        1999.98  North America    Credit Card
1           1      499.99         499.99         Europe         PayPal
2           3       69.99         209.97           Asia     Debit Card
3           4       15.99          63.96  North America    Credit Card
4           1       89.99          89.99         Europe         PayPal

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,8/23/2024,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,8/24/2024,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,8/25/2024,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,8/26/2024,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,8/27/2024,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [18]:
data={
    'name':['sans','ajay','sssd'],
    'age':[25,30,32],
    'city':['bdjje','dshjb','djhbj']
}
data

{'name': ['sans', 'ajay', 'sssd'],
 'age': [25, 30, 32],
 'city': ['bdjje', 'dshjb', 'djhbj']}

In [19]:
df

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,1/1/2024,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,1/2/2024,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,1/3/2024,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,1/4/2024,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,1/5/2024,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal
...,...,...,...,...,...,...,...,...,...
235,10236,8/23/2024,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,8/24/2024,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,8/25/2024,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,8/26/2024,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,8/27/2024,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [20]:
df=pd.DataFrame(data)

In [21]:
df

   name  age   city
0  sans   25  bdjje
1  ajay   30  dshjb
2  sssd   32  djhbj

In [22]:
df['name']

0    sans
1    ajay
2    sssd
Name: name, dtype: object

In [23]:
df.loc[0]

name     sans
age        25
city    bdjje
Name: 0, dtype: object

In [24]:
df.iloc[0]

name     sans
age        25
city    bdjje
Name: 0, dtype: object

In [25]:
df

   name  age   city
0  sans   25  bdjje
1  ajay   30  dshjb
2  sssd   32  djhbj

In [28]:
df['salary']=[20,30,40]
df

   name  age   city  salary
0  sans   25  bdjje      20
1  ajay   30  dshjb      30
2  sssd   32  djhbj      40

In [30]:
df.drop('salary',axis=1)

   name  age   city
0  sans   25  bdjje
1  ajay   30  dshjb
2  sssd   32  djhbj

In [31]:
df

   name  age   city  salary
0  sans   25  bdjje      20
1  ajay   30  dshjb      30
2  sssd   32  djhbj      40

In [32]:
df['age']=df['age']+1

In [33]:
df

   name  age   city  salary
0  sans   26  bdjje      20
1  ajay   31  dshjb      30
2  sssd   33  djhbj      40

In [34]:
df=pd.read_csv('sales_data.csv')

In [35]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000